# 處理 outliers
* 新增欄位註記
* outliers 或 NA 填補
    1. 平均數 (mean)
    2. 中位數 (median, or Q50)
    3. 最大/最小值 (max/min, Q100, Q0)
    4. 分位數 (quantile)

In [3]:
# Import 需要的套件
import os
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

%matplotlib inline

# 設定 data_path
dir_data = '../data/Part01/'

In [38]:
data_path = os.path.join(dir_data, 'application_train.csv')

In [39]:
df = pd.read_csv(data_path)
df.head()

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,100002,1,Cash loans,M,N,Y,0,202500.0,406597.5,24700.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
1,100003,0,Cash loans,F,N,N,0,270000.0,1293502.5,35698.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,135000.0,6750.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
3,100006,0,Cash loans,F,N,Y,0,135000.0,312682.5,29686.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,100007,0,Cash loans,M,N,Y,0,121500.0,513000.0,21865.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0

## 1. 列出 AMT_ANNUITY 的 q0 - q100
## 2.1 將 AMT_ANNUITY 中的 NAs 暫時以中位數填補
## 2.2 將 AMT_ANNUITY 的數值標準化至 -1 ~ 1 間
## 3. 將 AMT_GOOD_PRICE 的 NAs 以眾數填補

In [40]:
df['AMT_ANNUITY'].describe()

count    307499.000000
mean      27108.573909
std       14493.737315
min        1615.500000
25%       16524.000000
50%       24903.000000
75%       34596.000000
max      258025.500000
Name: AMT_ANNUITY, dtype: float64

In [41]:

# 1: 計算 AMT_ANNUITY 的 q0 - q100
q_all = df['AMT_ANNUITY'].quantile(np.arange(0, 1.01, 0.01))

df_q = pd.DataFrame({'q_score': list(range(101)),
              'actual_value': q_all})

In [42]:
df_q[df_q.q_score ==50]['actual_value'].values

array([24903.])

In [45]:
df.AMT_ANNUITY.median()

24903.0

In [43]:
# 2.1 將 NAs 以 q50 填補
df['AMT_ANNUITY'].isnull().value_counts()

False    307499
True         12
Name: AMT_ANNUITY, dtype: int64

In [44]:
df['AMT_ANNUITY'][df['AMT_ANNUITY'].isnull()]

47531    NaN
50035    NaN
51594    NaN
55025    NaN
59934    NaN
75873    NaN
89343    NaN
123872   NaN
207186   NaN
227939   NaN
239329   NaN
241835   NaN
Name: AMT_ANNUITY, dtype: float64

In [36]:
"""
Your Code Here
"""
q_50 = df_q[df_q.q_score ==50]['actual_value'].values

df.loc[df['AMT_ANNUITY'].isnull(),'AMT_ANNUITY'] = q_50

print("After replace NAs, numbers of row that AMT_ANNUITY is NAs: %i" % sum(df['AMT_ANNUITY'].isnull()))

After replace NAs, numbers of row that AMT_ANNUITY is NAs: 0

### Hints: Normalize function (to -1 ~ 1)
$ y = 2*(\frac{x - min(x)}{max(x) - min(x)} - 0.5) $

In [ ]:
# 2.2 Normalize values to -1 to 1

In [46]:
df['AMT_ANNUITY'].describe()

count    307499.000000
mean      27108.573909
std       14493.737315
min        1615.500000
25%       16524.000000
50%       24903.000000
75%       34596.000000
max      258025.500000
Name: AMT_ANNUITY, dtype: float64

In [60]:
def normalize_value(arr_x):
    normalized_arr_x = (arr_x - min(arr_x)) / (max(arr_x) - min(arr_x))
    return normalized_arr_x

In [68]:
np.where(df['AMT_ANNUITY']==258025.5)

(array([17948]),)

In [69]:
normalize_value(df['AMT_ANNUITY']).iloc[17948]

1.0

In [71]:
df['AMT_ANNUITY_NORMALIZED'] = normalize_value(df['AMT_ANNUITY'])

print("== Normalized data range ==")
df['AMT_ANNUITY_NORMALIZED'].describe()

== Normalized data range ==

count    307499.000000
mean          0.099423
std           0.056526
min           0.000000
25%           0.058143
50%           0.090821
75%           0.128624
max           1.000000
Name: AMT_ANNUITY_NORMALIZED, dtype: float64

In [72]:
# 3
print("Before replace NAs, numbers of row that AMT_GOODS_PRICE is NAs: %i" % sum(df['AMT_GOODS_PRICE'].isnull()))

Before replace NAs, numbers of row that AMT_GOODS_PRICE is NAs: 278

In [76]:
# 列出重複最多的數值
df['AMT_GOODS_PRICE'].value_counts().head()

450000.0    26022
225000.0    25282
675000.0    24962
900000.0    15416
270000.0    11428
Name: AMT_GOODS_PRICE, dtype: int64

In [77]:
df['AMT_GOODS_PRICE'].mode().values

array([450000.])

In [79]:
value_most = df['AMT_GOODS_PRICE'].mode().values
print(value_most)

[450000.]

In [80]:
mode_goods_price = list(df['AMT_GOODS_PRICE'].value_counts().index)

In [84]:
mode_goods_price[0:5]

[450000.0, 225000.0, 675000.0, 900000.0, 270000.0]

In [83]:
df.loc[df['AMT_GOODS_PRICE'].isnull(), 'AMT_GOODS_PRICE'] = mode_goods_price[0]

print("After replace NAs, numbers of row that AMT_GOODS_PRICE is NAs: %i" % sum(df['AMT_GOODS_PRICE'].isnull()))

After replace NAs, numbers of row that AMT_GOODS_PRICE is NAs: 0